In [4]:
%matplotlib inline
import pandas as pd, numpy as np, matplotlib.pyplot as plt

In [5]:
df = pd.read_csv('data/summer-travel-gps-full.csv')
df.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [6]:
# Q1: how to get 2 columns from the dataframe (city and country)?

print(df[['city','country']])

              city         country
0     West Drayton  United Kingdom
1         Hounslow  United Kingdom
2         Hounslow  United Kingdom
3         Hounslow  United Kingdom
4         Hounslow  United Kingdom
...            ...             ...
1754        Munich         Germany
1755        Munich         Germany
1756        Munich         Germany
1757        Munich         Germany
1758        Munich         Germany

[1759 rows x 2 columns]

In [7]:
# Q2: how to get the first 5 rows of the "city" column?

print(df['city'].head())

0    West Drayton
1        Hounslow
2        Hounslow
3        Hounslow
4        Hounslow
Name: city, dtype: object

In [8]:
# Q3: how to use .loc to select the third row of the dataframe?

df.loc[3]

lat               51.478199
lon               -0.446081
date       05/14/2014 11:24
city               Hounslow
country      United Kingdom
Name: 3, dtype: object

In [10]:
# Q4: how to use .loc to select the first row in "country" column?

df.loc[1, 'country']

'United Kingdom'

In [16]:
# Q5: how to select the first 4 rows of ['city', 'date'] columns?

df.loc[1:4, ['city', 'date']]

       city              date
1  Hounslow  05/14/2014 09:22
2  Hounslow  05/14/2014 10:51
3  Hounslow  05/14/2014 11:24
4  Hounslow  05/14/2014 11:38

In [11]:
# Q6: how to get the value from the row in position 3 and the column in position 2

df.iloc[2, [3]]

city    Hounslow
Name: 2, dtype: object

In [18]:
# Q7: how to use iloc to select every 300th row from a data set

df.iloc[300]

lat               41.377091
lon                2.151175
date       05/20/2014 03:18
city              Barcelona
country               Spain
Name: 300, dtype: object

In [19]:
# Q9: create a Series of true/false, indicating if each "city" row in the column is equal to "Munich"

print(df['city'] == 'Munich')

0       False
1       False
2       False
3       False
4       False
        ...
1754     True
1755     True
1756     True
1757     True
1758     True
Name: city, Length: 1759, dtype: bool

In [23]:
# Q10: what cities were visited in spain that were not barcelona? Create a dataframe for it. 

not_barca = df[(df['country'].isin(['Spain'])) & (df['city'] != 'Barcelona')]
print(not_barca)

            lat       lon              date                     city country
263   41.303911  2.105931  05/18/2014 22:35     El Prat de Llobregat   Spain
264   41.292723  2.075583  05/18/2014 22:49               Viladecans   Spain
265   41.289946  2.064590  05/18/2014 23:04               Viladecans   Spain
266   41.294143  2.073177  05/18/2014 23:20               Viladecans   Spain
267   41.320125  2.090935  05/18/2014 23:34     El Prat de Llobregat   Spain
1012  41.306752  2.097624  06/12/2014 17:19     El Prat de Llobregat   Spain
1013  41.312086  2.077921  06/12/2014 17:35     El Prat de Llobregat   Spain
1014  41.304333  2.072728  06/12/2014 17:49     El Prat de Llobregat   Spain
1015  41.354599  2.122235  06/12/2014 18:04  Hospitalet de Llobregat   Spain
1033  41.359580  2.128153  06/13/2014 11:05  Hospitalet de Llobregat   Spain
1034  41.359702  2.130125  06/13/2014 11:19  Hospitalet de Llobregat   Spain
1035  41.358460  2.128701  06/13/2014 11:35  Hospitalet de Llobregat   Spain
1360  41.294761  2.059722  06/20/2014 22:15               Viladecans   Spain
1361  41.304421  2.062938  06/20/2014 23:14     El Prat de Llobregat   Spain

In [24]:
# Q11: select rows where either the city is munich, or the country is serbia

munich_or_serbia = df[(df['city'].isin(['Munich'])) | (df['country'] == 'Serbia')]

print(munich_or_serbia)

            lat        lon              date       city  country
1362  44.821164  20.289821  06/21/2014 01:59   Belgrade   Serbia
1363  44.814263  20.463396  06/21/2014 02:29   Belgrade   Serbia
1364  44.814237  20.463395  06/21/2014 04:29   Belgrade   Serbia
1365  44.814260  20.463441  06/21/2014 05:30   Belgrade   Serbia
1366  44.814255  20.463413  06/21/2014 08:00   Belgrade   Serbia
1367  44.814763  20.462994  06/21/2014 10:14   Belgrade   Serbia
1368  44.814257  20.463436  06/21/2014 13:29   Belgrade   Serbia
1369  44.814246  20.463423  06/21/2014 13:45   Belgrade   Serbia
1370  44.814242  20.463396  06/21/2014 15:29   Belgrade   Serbia
1371  44.817690  20.464091  06/21/2014 17:29   Belgrade   Serbia
1372  44.820414  20.463465  06/21/2014 18:44   Belgrade   Serbia
1373  44.814251  20.463413  06/21/2014 19:30   Belgrade   Serbia
1374  44.814237  20.463392  06/21/2014 22:14   Belgrade   Serbia
1375  44.814209  20.463401  06/22/2014 05:14   Belgrade   Serbia
1376  44.761583  19.577904  06/22/2014 07:58  Slepčević   Serbia
1753  48.356417  11.792155  07/09/2014 13:11     Munich  Germany
1754  48.356013  11.791710  07/09/2014 13:13     Munich  Germany
1755  48.356529  11.792183  07/09/2014 13:14     Munich  Germany
1756  48.356285  11.791710  07/09/2014 13:17     Munich  Germany
1757  48.355328  11.791710  07/09/2014 13:18     Munich  Germany
1758  48.357110  11.791346  07/09/2014 13:20     Munich  Germany

In [25]:
# Q12: how many observations are west of the prime meridian?

print(len(df[(df['lon'] >= 0)]))

1496

In [13]:
# Q13: get all rows that contain a city that starts with the letter G

print( df[df['city'].str[0] == 'G'])

            lat        lon              date         city  country
659   50.273632  18.729429  06/02/2014 06:39      Gliwice   Poland
660   50.273632  18.729429  06/02/2014 06:55      Gliwice   Poland
942   48.282940   8.199630  06/10/2014 13:33       Gutach  Germany
943   48.389029   8.021342  06/10/2014 13:48   Gengenbach  Germany
1575  40.187827  20.079304  07/04/2014 17:39  Gjirokastër  Albania
1576  40.187825  20.079303  07/04/2014 17:42  Gjirokastër  Albania

In [20]:
# Q14: how many unique cities and countries in the dataset? 

print(df.nunique())


print(df.isnull().sum())

# There are no missing values?

# Also can you check missing values for the dataframe

lat        1720
lon        1720
date       1758
city        113
country      15
dtype: int64
lat        0
lon        0
date       0
city       0
country    0
dtype: int64

In [26]:
# Q15: group by country name and show the city names in each of the country

gdf = df.groupby(['country', 'city'])
  
# Print the first value in each group
gdf.first(20)

                                                         lat        lon
country                city
Albania                Berat                       40.702196  19.946431
                       Gjirokastër                 40.187827  20.079304
Bosnia and Herzegovina Herzegovina-Neretva Canton  42.911720  17.627780
                       Mostar                      43.345760  17.811691
                       Sarajevo                    43.859518  18.425945
...                                                      ...        ...
Spain                  Hospitalet de Llobregat     41.354599   2.122235
                       Viladecans                  41.292723   2.075583
Turkey                 Istanbul                    40.982352  28.815756
United Kingdom         Hounslow                    51.474005  -0.450999
                       West Drayton                51.481292  -0.451011

[113 rows x 2 columns]

In [27]:
# load the location data set, indexed by the date field
# and, parse the dates so they're no longer strings but now rather Python datetime objects
# this lets us do date and time based operations on the data set
dt = pd.read_csv('data/summer-travel-gps-full.csv', index_col='date', parse_dates=True)
dt.head()

                           lat       lon          city         country
date
2014-05-14 09:07:00  51.481292 -0.451011  West Drayton  United Kingdom
2014-05-14 09:22:00  51.474005 -0.450999      Hounslow  United Kingdom
2014-05-14 10:51:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:24:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:38:00  51.474146 -0.451562      Hounslow  United Kingdom

In [3]:
# Q16: is the timestamp index unique? How can you use code to find it?

In [4]:
# Q17: drop duplicate index

In [5]:
# Q18: create a weekday and a weekend dataframe

In [ ]:
# Q19: calculate and plot the number of observations each day of the week has